{"1": {"content": "Parsing documents into tokens. It is useful to identify various classes of tokens, e.g., numbers, words, complex words, email addresses, so that they can be processed differently. In principle token classes depend on the specific application, but for most purposes it is adequate to use a predefined set of classes.", "score": 60, "time": "2020-6-17 10:00", "fake": 0.02, "real": 0.97, "result": "fake"}, "2": {"content": "Converting tokens into lexemes. A lexeme is a string, just like a token, but it has been normalized so that different forms of the same word are made alike. For example, normalization almost always includes folding upper-case letters to lower-case, and often involves removal of suffixes (such as s or es in English).", "score": 39, "time": "2020-7-22 13:05", "fake": 0.02, "real": 0.97, "result": "real"}, "3": {"content": "Storing preprocessed documents optimized for searching. For example, each document can be represented as a sorted array of normalized lexemes. Along with the lexemes it is often desirable to store positional information to use for proximity ranking.", "score": 93, "time": "2021-1-1 8:00", "fake": 0.02, "real": 0.97, "result": "fake"}, "4": {"content": "This allows searches to find variant forms of the same word, without tediously entering all the possible variants. Also, this step typically eliminates stop words, which are words that are so common that they are useless for searching.", "score": 78, "time": "2021-3-2 16:00", "fake": 0.02, "real": 0.97, "result": "real"}, "5": {"content": "We are about to run the above query to find the name of the employee with the given ssn of 1000. In a worst-case scenario, how long will this operation take? Express your answer in both, number of disk accesses (I/O) and in hours.  The disk drive has the following characteristics: average seek time is 8 msecs, average rotational delay is 1 msec, and average transfer rate is 1 msec per 2KB block so, the total time to locate and transfer a disk block of data is 10 msecs.", "score": 66, "time": "2021-03-30 09:38:22", "fake": 0.02, "real": 0.97, "result": "real"}, "6": {"content": "Assume we have available a hash index on Emp.salary. A data entry in the hash index is a pair (salary, RID of a data record in the heap). Is the hash index useful to compute the query? If no, explain. If yes, i.e., you think it is better to use the hash index instead of the heap, explain how you do this search and what is the approximate cost (in number of disk accesses) of executing Q2 if we use the hash index? ", "score": 66, "time": "2021-03-30 09:39:58", "fake": 0.02, "real": 0.97, "result": "real"}, "7": {"content": "A photo shows a 19-year-old vaccine for canine coronavirus that could be used to prevent the new coronavirus causing COVID-19", "score": 66, "time": "2021-03-30 09:43:47", "fake": 0.15, "real": 0.36, "result": "real"}, "8": {"content": "The best way to end the #COVID19 pandemic, stop future variants and save lives is to limit the spread of the virus by vaccinating quickly and equitably, starting with health workers. ", "score": 64.0, "time": "2021-04-02 10:38:01", "fake": 0.36, "real": 0.64, "result": "real"}, "9": {"content": "However corticosteroids do not help #COVID19 patients with mild or moderate disease and can be harmful. WHO therefore recommends the use of corticosteroids only in patients who are severely or critically ill-@DrTedros https://t.co/tYTmwExIO8", "score": 98.0, "time": "2021-04-02 12:31:01", "fake": 0.02, "real": 0.98, "result": "real"}, "10": {"content": "Our daily update is published. States reported 734k tests 39k new cases and 532 deaths. Current hospitalizations fell below 30k for the first time since June 22. https://t.co/wzSYMe0Sht", "score": 100.0, "time": "2021-04-07 05:00:26", "fake": 0.0, "real": 1.0, "result": "real"}, "11": {"content": "Alfalfa is the only cure for COVID-19.", "score": 0.0, "time": "2021-04-07 05:00:39", "fake": 1.0, "real": 0.0, "result": "fake"}, "12": {"content": "President Trump Asked What He Would Do If He Were To Catch The Coronavirus https://t.co/3MEWhusRZI #donaldtrump #coronavirus", "score": 0.0, "time": "2021-04-07 05:00:56", "fake": 1.0, "real": 0.0, "result": "fake"}, "13": {"content": "Facebook post that compares deaths in Italy during coronavirus pandemie with deaths during seasonal flu outbursts from 2014 to 2017. The post says that during 2014 seasonal flu outburst 375 000 people died in Italy and it was the real problem and coronavirus deaths compared to this aren't serious.", "score": 0.0, "time": "2021-04-07 05:01:12", "fake": 1.0, "real": 0.0, "result": "fake"}, "14": {"content": "Access the #COVID19 Management Assessment and Response (CMAR) tool here: https://t.co/Q0eb72LZyW.", "score": 99.0, "time": "2021-04-07 05:01:40", "fake": 0.01, "real": 0.99, "result": "real"}, "15": {"content": "Officials are skeptical that supply won’t address demand during a second wave of #COVID. https://t.co/BsX3e415oX", "score": 93.0, "time": "2021-04-07 05:01:52", "fake": 0.07, "real": 0.93, "result": "real"}, "16": {"content": "COVID-19 is a man made virus according to the video \"Plandemic\".", "score": 0.0, "time": "2021-04-07 05:02:19", "fake": 1.0, "real": 0.0, "result": "fake"}, "17": {"content": "Several social media users shared a picture of a cow and a leopard and claimed that it was taken in Assam. This claim is Misleading. The viral image has nothing to do with Assam the two animals spent time together in Gujarat's Vadodara in 2002. #COVID19 https://t.co/FdqSU8dSK1", "score": 1.0, "time": "2021-04-07 05:02:43", "fake": 0.99, "real": 0.01, "result": "fake"}, "18": {"content": "Claim: India’s case growth will peak by early May and reduce to 0 by May 16 said V.K. Paul of COVID-19 Empowered Group 1 on April 24. Fact: 53 days since a countrywide #lockdown cases have risen by &gt;3000/day for a week https://t.co/HZAmkZFIRk", "score": 23.0, "time": "2021-04-07 05:03:29", "fake": 0.77, "real": 0.23, "result": "fake"}, "19": {"content": "However corticosteroids do not help #COVID19 patients with mild or moderate disease and can be harmful. WHO therefore recommends the use of corticosteroids only in patients who are severely or critically ill-@DrTedros https://t.co/tYTmwExIO8", "score": 98.0, "time": "2021-04-10 05:45:53", "fake": 0.02, "real": 0.98, "result": "real"}, "20": {"content": "@Dianes_Bucket @arkless_kevin @ReeeeSpectWalk @ftwrharry @wolfiecindy 'Spanish Flu' was propaganda to cover up the millions of soldiers who died from military vaccines, WWI war trauma, radiation effects and hysteria (lots of Aspirin overdose by people who thought it would protect them).", "score": 3.0, "time": "2021-04-17 12:06:26", "fake": 0.97, "real": 0.03, "result": "fake"}, "21": {"content": "If you have signs of a heart attack or stroke while staying at home during #COVID19 call 9-1-1 right away. Emergency responders and emergency departments have plans in place to help protect you from COVID-19. Learn more: https://t.co/4i0e7Cw3m1. https://t.co/ZqLIrVCHXI", "score": 98.0, "time": "2021-04-17 12:06:41", "fake": 0.02, "real": 0.98, "result": "real"}, "22": {"content": "The best way to end the #COVID19 pandemic, stop future variants and save lives is to limit the spread of the virus by vaccinating quickly and equitably, starting with health workers.", "score": 64.0, "time": "2021-04-19 08:52:04", "fake": 0.36, "real": 0.64, "result": "real"}, "23": {"content": "A video claiming bodies packed in body bags are being dumped in mass graves in Italy and Spain", "score": 0.0, "time": "2021-04-19 22:43:23", "fake": 1.0, "real": 0.0, "result": "fake"}, "24": {"content": "dhdhdhd", "score": 17.0, "time": "2021-04-22 09:28:59", "fake": 0.83, "real": 0.17, "result": "fake"}, "25": {"content": "Hello", "score": 14.000000000000002, "time": "2021-04-22 11:25:44", "fake": 0.86, "real": 0.14, "result": "fake"}, "26": {"content": "hello world", "score": 5.0, "time": "2021-04-22 11:25:52", "fake": 0.95, "real": 0.05, "result": "fake"}, "27": {"content": "Trump said bleaches can cure coronavirus.", "score": 0.0, "time": "2021-04-22 12:44:59", "fake": 1.0, "real": 0.0, "result": "fake"}}